a = int(input('a값: '))       #2개 사용 연산 용
b = int(input('b값: '))       #2개 사용 연산 용
c = int(input('c값: '))       #1개 사용 연산 용
#-----------------------------------------------------------

#Step 1 and 
if a ==1 and b == 1:
    print(1)
else:
    print(0)

#-----------------------------------------------------------

#step 2 or
if a == 1 or b == 1:
    print(1)
else:
    print(0)

#-----------------------------------------------------------

#step 3 not
if c == 1:
    print(0)

elif c == 0:
    print(1)

#-----------------------------------------------------------

#step 4 xor

if a != b:
    print(1)
else:
    print(0)

#-----------------------------------------------------------

#step 5 nand

if a or b == 0:
    print(1)
else:
    print(0)

#-----------------------------------------------------------

#step 6 nor

if a and b == 0:
    print(1)
else:
    print(0)

#-----------------------------------------------------------

#step 7 xnor
if a == b:
    print(1)
else:
    print(0)
