import random

word = [

    '탄소화합물'
    ,'탄화수소'
    ,'화학식'
    ,'분자식'
    ,'시성식'
    ,'몰'
    ,'원자량'
    ,'분자량'
    ,'화학식량'
    ,'몰질량'
    ,'아보가드로법칙'
    ,'화학반응식'
    ,'기체반응법칙'
    ,'질량보존법칙'
    ,'화학양론'
    ,'용액'
    ,'용매'
    ,'용질'
    ,'퍼센트농도'
    ,'몰농도'
    ,'화학'
    ,'원자'
    ,'음극선'
    ,'전자'
    ,'알파입자'
    ,'양성자'
    ,'중성자'
    ,'원자번호'
    ,'질량수'
    ,'동위원소'
    ,'전자껍질'
    ,'주양자수'
    ,'방위양자수'
    ,'자기양자수'
    ,'전자전이'
    ,'바닥상태'
    ,'들뜬상태'
    ,'오비탈'
    ,'S오비탈'
    ,'P오비탈'
    ,'스핀'
    ,'쌓음원리'
    ,'파울리베타원리'
    ,'훈트규칙'
    ,'홀전자'
    ,'원자가전자'

]

meaning = [
    '탄소 원자가 다른 탄소 원자나 수소, 산소, 질소, 플루오린 등의 여러가지 원자들과 결합하여 이루어진 물질'
    ,'탄소와 수소로만 이루어진 탄소 화합물'
    ,'원소 기호와 숫자를 사용하여 물질을 구성하는 원자의 종류와 개수를 나타낸 것'
    ,'화학식 중에서 분자를 이루는 원자의 종류와 개수를 나타낸 것'
    ,'작용기를 따로 나타낸 화학식 (COOH와 같은 작용기가 있다)'
    ,'입자를 아보가드로수(6.02 x 10^23)만큼 모은 단위'
    ,'원자의 상대적인 질량'
    ,'원자들이 만들어진 분자의 상대적 질량'
    ,'분자로 존재하지 않는 물질의 상대적인 질량을 화학식을 이루는 원자들의 원자량으로 합하여 구한것'
    ,'물질 1 몰의 질량을 나타낸것'
    ,'같은 온도와 압력에서 모든 기체는 같은 부피속에서 같은 분자를 가지고있다 (22.4 L)'
    ,'반응물과 생성물의 관계를 화학식을 이용하여 나타낸것'
    ,'온도와 압력이 같은 때 반응 기체와 생성 기체의 부피 사이에 간단한 정수비가 성립하는것'
    ,'반응전 기체의 질량과 반응 후 기체의 질량이 같은것 (변화 X)'
    ,'화학 반응에서 반응물과 생성물 사이의 양적 관계를 설명하는 이론'
    ,'두 종류 이상의 순물질이 균일하게 섞여있는 혼합물'
    ,'물과 같이 다른물질을 녹이는 물질'
    ,'용매에 녹는 물질'
    ,'용액 100g에 녹아있는 용질의 질량을 퍼센트로 나타낸것'
    ,'용질의 입자 수를 이용하여 농도를 나타낸것'
    ,'물질의 구조나 성질을 알아내고 물질들 사이의 반응을 연구하는 학문'
    ,'물질을 이루는 가장 근본이 되는 입자'
    ,'(-)극에서 (+)극으로 빛이 흐르는 것'
    ,'음극선을 이루는 입자는 원자를 구성하는 공통적인 입자'
    ,'헬륨의 원자핵으로, 방사성 물질에서 방출됨'
    ,'모든 원소에 공통으로 들어 있는 (+)전하를 띠는 기본 입자'
    ,'알파 입자를 충돌시켰을 때 전하를 띠지 않는 입자'
    ,'양성자수'
    ,'양성자수와 중성자수를 합한 수'
    ,'양성자수는 같으나 중성자수가 달라서 질량수가 다른 원소'
    ,'특정한 에너지 준위의 원형 궤도'
    ,'원자핵으로부터 가장 가까운 것부터 나타내는 수, 오비탈의 크기와 에너지를 결정(n=1, n=2, n=3…)'    
    ,'오비탈의 종류를 결정'
    ,'오비탈의 방향을 결정'
    ,'전자가 한 에너지 준위에서 다른 에너지 준위로 이동하는 현상'
    ,'원자의 에너지가 가장 낮은 상태'
    ,'전자가 에너지를 흡수하여 높은 에너지 준위로 올라가 있는 상태'
    ,'일정한 에너지의 전자가 원자핵 주위에서 발견될 확률 분포를 나타낸 것'
    ,'공 모양이며 전자가 존재할 확률은 방향과 관계없이 원자핵으로부터의 거리에 따라서만 달라진다.'
    ,'아령 모양이며 원자핵으로부터의 방향에 따라 전자의 존재 확률이 다르다.'
    ,'전자의 자전'
    ,'바닥상태의 원자에서는 에너지 준위가 낮은 오비탈부터 전자가 순서대로 채워지는 것'
    ,'한 원자 안에 있는 어떤 전자도 4가지 양자수가 모두 같을 수 없는 것'
    ,'에너지 준위가 같은 오비탈에 전자가 채워질 때는 가능하면 전자가 쌍을 이루지 않게 배치될 때 더 안전하다는 것'
    ,'쌍을 이루지 않는 전자'
    ,'원자의 바닥상태 전자 배치에서 화학 결합에 관여하는 가장 바깥 전자 껍질에 채워진 전자'

]

wrong = []

score = 0
count = int(input('몇번 단어 시험 신행할까요? (1 ~ 46)  '))
print('ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ')
print('응답은 띄어쓰기 없이 작성해 주시고 오비탈 앞 영어는 대문자로 해주세요 [ex) 탄소 화합물 (X), 탄소화합물(O)]')
print('ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ')

for i in range(count):
    number = int(random.randint(1, 45))
    print(meaning[number])
    answer = input()

    if answer == word[number]:
       score = score + 1
    
    elif answer != word[number]:
        score = score
        wrong.append(number)
    print('ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ')

print('제시된 문제 수 : ',count,'  맞춘 문제 수 : ',score)
print('아래 목록은 당신이 틀린 단어들 입니다.')
print('ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ')
for q in range(count - score):

    print(word[wrong[q-1]],' 뜻: ',meaning[wrong[q-1]])
print('ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ')

# 2023/10/03
#제작: 20611 박종상
#패치: 틀린단어, 해당 단어 뜻 출력하기 2023/10/03/22:04/
